# AnalyticalNodeData Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalyticalNodeData Properties
AnalyticalNodeData Class See Also
---
The AnalyticalNodeData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
AnalyticalNodeData Class
Autodesk.Revit.DB.Structure Namespace